Repository: franmanez/issueSpotlight
Catalog: locale/*/locale.po
Languages: ca_es, es_es

# plugins.generic.issueSpotlight.analysisTitle
source: IssueSpotlight AI - intelligent issue analysis
ca_es: IssueSpotlight AI - anàlisi intel·ligent de números
es_es: IssueSpotlight AI - análisis inteligente de números

# plugins.generic.issueSpotlight.description
source: Intelligent issue analysis via AI: editorial draft, innovation radar, SDG impact, and global map of authors.
ca_es: Anàlisi intel·ligent de números mitjançant IA: editorial, radar d'innovació, impacte ODS i mapa global d'autors.
es_es: Análisis inteligente de números mediante IA: editorial, radar de innovación, impacto ODS y mapa global de autores.

# plugins.generic.issueSpotlight.detailedDescription
source: This module presents advanced analysis perspectives obtained through artificial intelligence:<ul style="margin-top:5px; padding-left:20px;"><li><strong>Editorial Summary:</strong> Automatic draft of an editorial summarizing key themes.</li><li><strong>Innovation Radar:</strong> Visual map of emerging and consolidated technological trends.</li><li><strong>SDG Impact:</strong> Assessment of thematic alignment with the UN Sustainable Development Goals.</li><li><strong>Global Map:</strong> Visualization of the geographical distribution of authors and represented institutions.</li></ul>
ca_es: Aquest mòdul presenta perspectives d'anàlisi avançades obtingudes mitjançant intel·ligència artificial:<ul style="margin-top:5px; padding-left:20px;"><li><strong>Resum editorial:</strong> Generació automàtica d'un esborrany editorial sintetitzant els temes clau.</li><li><strong>Radar d'Innovación:</strong> Mapa visual de tendències tecnològiques emergents i consolidades.</li><li><strong>Impacte ODS:</strong> Avaluació de l'alineació temàtica amb els Objectius de Desenvolupament Sostenible.</li><li><strong>Mapa Global:</strong> Visualització de la distribució geogràfica d'autors i institucions representades.</li></ul>
es_es: Este módulo presenta perspectivas de análisis avanzadas obtenidas mediante inteligencia artificial:<ul style="margin-top:5px; padding-left:20px;"><li><strong>Resumen editorial:</strong> Generación automática de un borrador editorial sintetizando los temas clave.</li><li><strong>Radar de Innovación:</strong> Mapa visual de tendencias tecnológicas emergentes y consolidadas.</li><li><strong>Impacto ODS:</strong> Evaluación de la alineación temática con los Objetivos de Desarrollo Sostenible.</li><li><strong>Mapa Global:</strong> Visualización de la distribución geográfica de autores e instituciones representadas.</li></ul>

# plugins.generic.issueSpotlight.settings
source: Settings
ca_es: Configuració
es_es: Configuración

# plugins.generic.issueSpotlight.settings.apiKey
source: Gemini API Key
ca_es: Clau API de Gemini
es_es: Clave API de Gemini

# plugins.generic.issueSpotlight.settings.apiKeyDescription
source: In order for the plugin to work, an access key for Google's artificial intelligence (Gemini) is required. This key enables the automatic analysis of titles and abstracts to generate the editorial, radar, SDGs, and institutional map.<br><br><strong>Consumption and Limits:</strong> Each complete issue analysis makes 4 calls to the Gemini LLM. The Gemini free plan allows a maximum of 20 daily requests.<br><br><strong>How to obtain the key:</strong><br>1. Go to <a href="https://aistudio.google.com/" target="_blank">Google AI Studio</a>.<br>2. Click on 'Get API key'.<br>3. Click on 'Create API key'.<br>4. Copy the key (it has a format similar to: <code>AIzaSyC3xY9mN2pQ7rT8vU1wX4zK6jL5hM9nO0p</code>) and paste it here.<br><br><strong>How to run the analysis:</strong><br>Once the key is configured, go to <strong>Issues</strong> in the backend, click on the dropdown arrow for the issue you want to analyze and select the <strong>IssueSpotlight IA</strong> link to run the intelligent analysis.
ca_es: Perquè el plugin funcioni, cal una clau d'accés a la intel·ligència artificial de Google (Gemini). Aquesta clau permet fer l'anàlisi automàtica de títols i resums per generar l'editorial, el radar, els ODS i el mapa institucional.<br><br><strong>Consum i Límits:</strong> Cada anàlisi completa d'un número fa 4 trucades a l'LLM de Gemini. El pla gratuït de Gemini permet un màxim de 20 consultes diàries.<br><br><strong>Com obtenir la clau:</strong><br>1. Accedeix a <a href="https://aistudio.google.com/" target="_blank">Google AI Studio</a>.<br>2. Fes clic a 'Get API key'.<br>3. Prem a 'Create API key'.<br>4. Copia la clau (té un format similar a: <code>AIzaSyC3xY9mN2pQ7rT8vU1wX4zK6jL5hM9nO0p</code>) i enganxa-la aquí.<br><br><strong>Com executar l'anàlisi:</strong><br>Un cop configurada la clau, ves a <strong>Números</strong> al backend, fes clic a la fletxeta del número que vols analitzar i selecciona l'enllaç <strong>IssueSpotlight IA</strong> per executar l'anàlisi intel·ligent.
es_es: Para que el plugin funcione, es necesaria una clave de acceso a la inteligencia artificial de Google (Gemini). Esta clave permite realizar el análisis automático de títulos y resúmenes para generar la editorial, el radar, los ODS y el mapa institucional.<br><br><strong>Consumo y Límites:</strong> Cada análisis completo de un número realiza 4 llamadas al LLM de Gemini. El plan gratuito de Gemini permite un máximo de 20 consultas diarias.<br><br><strong>Cómo obtener la clave:</strong><br>1. Accede a <a href="https://aistudio.google.com/" target="_blank">Google AI Studio</a>.<br>2. Haz clic en 'Get API key'.<br>3. Pulsa en 'Create API key'.<br>4. Copia la clave (tiene un formato similar a: <code>AIzaSyC3xY9mN2pQ7rT8vU1wX4zK6jL5hM9nO0p</code>) y pégala aquí.<br><br><strong>Cómo ejecutar el análisis:</strong><br>Una vez configurada la clave, ve a <strong>Números</strong> en el backend, haz clic en la flechita del número que deseas analizar y selecciona el enlace <strong>IssueSpotlight IA</strong> para ejecutar el análisis inteligente.

# plugins.generic.issueSpotlight.settings.apiKeyRequired
source: The API key is required.
ca_es: La clau API és obligatòria.
es_es: La clave API es obligatoria.

# plugins.generic.issueSpotlight.analysisLoading
source: Ready to analyze the issue.
ca_es: Llest per analitzar el número.
es_es: Listo para analizar el número.

# plugins.generic.issueSpotlight.startAnalysis
source: Start AI Analysis
ca_es: Iniciar l'anàlisi amb IA
es_es: Iniciar análisis con IA

# plugins.generic.issueSpotlight.analyzing
source: Analyzing
ca_es: Analitzant
es_es: Analizando

# plugins.generic.issueSpotlight.noArticles
source: No articles found in this issue.
ca_es: No s'han trobat articles en aquest número.
es_es: No se han encontrado artículos en este número.

# plugins.generic.issueSpotlight.errorAnalysis
source: An error occurred while calling the AI service. Please check your API Key.
ca_es: S'ha produït un error en trucar al servei d'IA. Comprova la teva clau API.
es_es: Se ha producido un error al llamar al servicio de IA. Comprueba tu clave API.

# plugins.generic.issueSpotlight.tab.editorial
source: Editorial Summary
ca_es: Resum editorial
es_es: Resumen editorial

# plugins.generic.issueSpotlight.tab.radar
source: Innovation Radar
ca_es: Radar d'Innovació
es_es: Radar de Innovación

# plugins.generic.issueSpotlight.tab.ods
source: SDG Impact
ca_es: Impacte ODS
es_es: Impacto ODS

# plugins.generic.issueSpotlight.tab.geo
source: Global Map
ca_es: Mapa Global
es_es: Mapa Global

# plugins.generic.issueSpotlight.backToIssue
source: Back to Issue identification
ca_es: Tornar al número
es_es: Volver al Número

# plugins.generic.issueSpotlight.banner.title
source: IssueSpotlight AI - intelligent issue analysis
ca_es: IssueSpotlight AI - anàlisi intel·ligent de números
es_es: IssueSpotlight AI - análisis inteligente de números

# plugins.generic.issueSpotlight.banner.btn
source: View Analysis
ca_es: Veure Anàlisi
es_es: Ver Análisis

# plugins.generic.issueSpotlight.explanation.editorial.title
source: Automatic Content Generation
ca_es: Generació Automàtica de Continguts
es_es: Generación Automática de Contenidos

# plugins.generic.issueSpotlight.explanation.editorial.desc
source: This editorial summary offers an overview of the topics addressed, prepared from the analysis of the titles and abstracts of the contributions in this issue.
ca_es: Aquest resum editorial ofereix una panoràmica dels temes abordats, elaborada a partir de l'anàlisi dels títols i resums de les contribucions d'aquest número.
es_es: Este resumen editorial ofrece una panorámica de los temas abordados, elaborada a partir del análisis de los títulos y resúmenes de las contribuciones de este número.

# plugins.generic.issueSpotlight.explanation.ods.title
source: Contribution to the Sustainable Development Goals
ca_es: Contribució als Objectius de Desenvolupament Sostenible
es_es: Contribución a los Objetivos de Desarrollo Sostenible

# plugins.generic.issueSpotlight.explanation.ods.desc
source: This chart shows the percentage of thematic alignment of the articles published in this issue with the UN 2030 Agenda. Additionally, each impacted goal is detailed with a brief analysis of its relevance in the publication.
ca_es: Aquest gràfic mostra el percentatge d'alineació temàtica dels articles publicats en aquest número amb l'Agenda 2030 de l'ONU. A més, es detalla cada objectiu impactat amb una breu anàlisi de la seva rellevància en la publicació.
es_es: Este gráfico muestra el porcentaje de alineación temática de los artículos publicados en este número con la Agenda 2030 de la ONU. Además, se detalla cada objetivo impactado con un breve análisis de su relevancia en la publicación.

# plugins.generic.issueSpotlight.explanation.radar.title
source: How to interpret this chart?
ca_es: Com interpretar aquest gràfic?
es_es: ¿Cómo interpretar este gráfico?

# plugins.generic.issueSpotlight.explanation.radar.desc
source: This radar visualizes the key concepts extracted from the issue. The <strong>size</strong> of the bubbles indicates the volume of occurrences. The <strong>colors</strong> represent the detected trend: <span style="color:#FF4757; font-weight:bold;">● Rising</span>, <span style="color:#2ED573; font-weight:bold;">● New</span> and <span style="color:#1E90FF; font-weight:bold;">● Stable</span>.
ca_es: Aquest radar visualitza els conceptes clau extrets del número. La <strong>mida</strong> de les bombolles indica el volum d'aparicions. Els <strong>colors</strong> representen la tendència detectada: <span style="color:#FF4757; font-weight:bold;">● En Alça</span>, <span style="color:#2ED573; font-weight:bold;">● Novetat</span> i <span style="color:#1E90FF; font-weight:bold;">● Consolidat</span>.
es_es: Este radar visualiza los conceptos clave extraídos del número. El <strong>tamaño</strong> de las burbujas indica el volumen de apariciones. Los <strong>colores</strong> representan la tendencia detectada: <span style="color:#FF4757; font-weight:bold;">● En Alza</span>, <span style="color:#2ED573; font-weight:bold;">● Novedad</span> y <span style="color:#1E90FF; font-weight:bold;">● Consolidado</span>.

# plugins.generic.issueSpotlight.bubble.size
source: Size
ca_es: Mida
es_es: Tamaño

# plugins.generic.issueSpotlight.bubble.volumen
source: Volume of occurrences
ca_es: Volum d'aparicions
es_es: Volumen de apariciones

# plugins.generic.issueSpotlight.bubble.rising
source: Rising
ca_es: En Alça (Rising)
es_es: En Alza (Rising)

# plugins.generic.issueSpotlight.bubble.new
source: New
ca_es: Novetat (New)
es_es: Novedad (New)

# plugins.generic.issueSpotlight.bubble.stable
source: Stable
ca_es: Consolidat (Stable)
es_es: Consolidado (Stable)

# plugins.generic.issueSpotlight.title.stable
source: Stable
ca_es: Consolidats
es_es: Consolidados

# plugins.generic.issueSpotlight.title.rising
source: Rising
ca_es: En Alça
es_es: En Alza

# plugins.generic.issueSpotlight.title.new
source: New
ca_es: Novetats
es_es: Novedades

# plugins.generic.issueSpotlight.ods.details
source: Detailed Impacted Goals
ca_es: Detall d'Objectius Impactats
es_es: Detalle de Objetivos Impactados

# plugins.generic.issueSpotlight.explanation.geo.title
source: Global Collaboration Map
ca_es: Mapa Global de Col·laboració
es_es: Mapa Global de Colaboración

# plugins.generic.issueSpotlight.explanation.geo.reach
source: International and Institutional Reach
ca_es: Abast Internacional i Institucional
es_es: Alcance Internacional e Institucional

# plugins.generic.issueSpotlight.explanation.geo.desc
source: This map visualizes the geographical origin of the authors of this issue. The <strong>points</strong> represent the institutions linked to the published research, where the size of each marker indicates the density of authors belonging to that institution.
ca_es: Aquest mapa visualitza l'origen geogràfic dels autors d'aquest número. Els <strong>punts</strong> representen les institucions vinculades a les investigacions publicades, on la mida de cada marcador indica la densitat d'autors que pertanyen a aquesta institució.
es_es: Este mapa visualiza el origen geográfico de los autores de este número. Los <strong>puntos</strong> representan las instituciones vinculadas a las investigaciones publicadas, donde el tamaño de cada marcador indica la densidad de autores pertenecientes a dicha institución.

# plugins.generic.issueSpotlight.geo.institution
source: Institution
ca_es: Institució
es_es: Institución

# plugins.generic.issueSpotlight.geo.international
source: International
ca_es: Internacional
es_es: Internacional

# plugins.generic.issueSpotlight.geo.national
source: National
ca_es: Nacional
es_es: Nacional

# plugins.generic.issueSpotlight.geo.authorsTitle
source: List of Authors and Affiliations
ca_es: Llistat d'Autors i Afiliacions
es_es: Listado de Autores y Afiliaciones

# plugins.generic.issueSpotlight.geo.author
source: Author
ca_es: Autor
es_es: Autor

# plugins.generic.issueSpotlight.geo.affiliation
source: Affiliation
ca_es: Afiliació
es_es: Afiliación

# plugins.generic.issueSpotlight.geo.article
source: Article
es_es: Artículo

# plugins.generic.issueSpotlight.geo.noAffiliation
source: No affiliation
ca_es: Sense afiliació
es_es: Sin afiliación

# plugins.generic.issueSpotlight.geo.noAuthors
source: No author data available.
ca_es: No hi ha dades d'autors disponibles.
es_es: No hay datos de autores disponibles.

# plugins.generic.issueSpotlight.analysisProcessDescription
source: Upon starting the process, the AI will analyze titles, abstracts, and affiliations to automatically generate the editorial draft, innovation radar, SDG impact, and institutional map. <br><br><strong>Note:</strong> This process consumes 4 calls to the Gemini LLM (the free plan allows up to 20 daily). You can regenerate the analysis at any time to update results.
ca_es: En iniciar el procés, la IA analitzarà els títols, resums i afiliacions per generar automàticament l'esborrany editorial, el radar d'innovació, l'impacte ODS i el mapa d'institucions. <br><br><strong>Nota:</strong> Aquest procés consumeix 4 trucades a l'LLM de Gemini (el pla gratuït permet fins a 20 diàries). Pots regenerar l'anàlisi en qualsevol moment per actualitzar els resultats.
es_es: Al iniciar el proceso, la IA analizará los títulos, resúmenes y afiliaciones para generar automáticamente el borrador editorial, el radar de innovación, el impacto ODS y el mapa de instituciones. <br><br><strong>Nota:</strong> Este proceso consume 4 llamadas al LLM de Gemini (el plan gratuito permite hasta 20 diarias). Puedes regenerar el análisis en cualquier momento para actualizar los resultados.

# plugins.generic.issueSpotlight.analysisCompleted
source: <strong>Analysis Completed!</strong> The AI-generated data has been successfully saved for issue {$issueId}.
ca_es: <strong>Anàlisi Completada!</strong> Les dades generades per la IA s'han desat correctament per al número {$issueId}.
es_es: <strong>¡Análisis Completado!</strong> Los datos generados por la IA se han guardado correctamente para el número {$issueId}.
